Tekla.Structures.Model.UI.ModelObjectVisualization
The class to set and clear temporary visualization (color and transparency) for model objects in view.
Permananet representation will be restored when view is redrawed or temporary visualization is cleared.
Can be used also to fetch current permanent representation of model object.
using Tekla.Structures.Model;
using Tekla.Structures.Geometry3d;
using System.Collections;
public class Example
{
public void Example1()
{
Model model = new Model();
Beam b = new Beam(new Point(0,0,0), new Point(0,0,6000));
Beam b1 = new Beam(new Point(0,1000,0), new Point(0,1000,6000));
Beam b2 = new Beam(new Point(0,2000,0), new Point(0,2000,6000));
b.Material.MaterialString = b1.Material.MaterialString = b2.Material.MaterialString = "Steel_Undefined";
b.Profile.ProfileString = b1.Profile.ProfileString = b2.Profile.ProfileString = "PL10*1000";
b.Insert();
b1.Insert();
b2.Insert();
model.CommitChanges();
var blueObjects = new List<ModelObject> { b , b2 };
var redObjects = new List<ModelObject> { b1 };
ModelObjectVisualization.SetTransparencyForAll(TemporaryTransparency.HIDDEN);
ModelObjectVisualization.SetTemporaryState(blueObjects, new TSM.UI.Color(0.0, 0.0, 1.0));
ModelObjectVisualization.SetTemporaryState(redObjects, new TSM.UI.Color(1.0, 0.0, 0.0));
}
}

Tekla.Structures.Model.UI.ModelObjectVisualization.SetTemporaryStateForAll(Tekla.Structures.Model.UI.Color)
Sets temporary visualization state (red, blue, green and transparency) for all model objects
color:
Returns:

Tekla.Structures.Model.UI.ModelObjectVisualization.SetTemporaryState(System.Collections.Generic.List{Tekla.Structures.Model.ModelObject},Tekla.Structures.Model.UI.Color)
Sets visualization temporary state (red, blue, green and transparency) for given model objects
modelObjects:
color:
Returns:

Tekla.Structures.Model.UI.ModelObjectVisualization.SetTransparencyForAll(Tekla.Structures.Model.UI.TemporaryTransparency)
Restores permanent representation settings and sets temporary transparency for all model objects
transparency:
Returns:

Tekla.Structures.Model.UI.ModelObjectVisualization.SetTransparency(System.Collections.Generic.List{Tekla.Structures.Model.ModelObject},Tekla.Structures.Model.UI.TemporaryTransparency)
Restores permanent representation settings and sets temporary transparency for given model objects
modelObjects:
transparency:
Returns:

Tekla.Structures.Model.UI.ModelObjectVisualization.SetTransparency(System.Collections.Generic.List{Tekla.Structures.Identifier},Tekla.Structures.Model.UI.TemporaryTransparency)
Restores permanent representation settings and sets temporary transparency for given model object identifiers
identifiers:
transparency:
Returns:

Tekla.Structures.Model.UI.ModelObjectVisualization.SetTemporaryState(System.Collections.Generic.List{Tekla.Structures.Identifier},Tekla.Structures.Model.UI.Color)
Sets visualization temporary state (red, blue, green and transparency) for given model object identifiers
identifiers:
color:
Returns:

Tekla.Structures.Model.UI.ModelObjectVisualization.GetRepresentation(Tekla.Structures.Model.ModelObject,Tekla.Structures.Model.UI.Color@)
Gets current permanent representation (red, blue, green and transparency) of given model object
modelObject:
color:
Returns:

Tekla.Structures.Model.UI.ModelObjectVisualization.ClearAllTemporaryStates
Clears temporary visualization from all model objects and restores permanent representation.
Returns: